<?xml version="1.0" ?>
<net name="saved_model" version="10">
	<layers>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data element_type="f16" shape="1,5,32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/matching_conv1D/conv1d/ExpandDims/dim/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/matching_conv1D/conv1d/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/matching_conv1D/conv1d/ExpandDims/Transpose/Cast_120311_const" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/matching_conv1D/conv1d/ExpandDims/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/matching_conv1D/conv1d/ExpandDims_1/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="40" shape="64,32,1,1" size="4096"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/matching_conv1D/conv1d" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/matching_conv1D/conv1d/Transpose/Cast_120271_const" type="Const" version="opset1">
			<data element_type="i64" offset="4136" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/matching_conv1D/conv1d/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/matching_conv1D/conv1d/Squeeze/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/matching_conv1D/conv1d/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/matching_conv1D/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="4168" shape="1,1,64" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/matching_conv1D/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/conv1D_0/conv1d/ExpandDims/dim/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/conv1D_0/conv1d/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/conv1D_0/conv1d/ExpandDims/Transpose/Cast_120321_const" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/conv1D_0/conv1d/ExpandDims/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/conv1D_0/conv1d/ExpandDims_1/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="4296" shape="64,32,1,2" size="8192"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/conv1D_0/conv1d" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/conv1D_0/conv1d/Transpose/Cast_120249_const" type="Const" version="opset1">
			<data element_type="i64" offset="4136" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/conv1D_0/conv1d/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/conv1D_0/conv1d/Squeeze/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/conv1D_0/conv1d/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/conv1D_0/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="12488" shape="1,1,64" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/conv1D_0/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/activation/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/conv1D_1/conv1d/ExpandDims/dim/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/conv1D_1/conv1d/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/conv1D_1/conv1d/ExpandDims/Transpose/Cast_120285_const" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/conv1D_1/conv1d/ExpandDims/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/conv1D_1/conv1d/ExpandDims_1/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="12616" shape="64,64,1,2" size="16384"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/conv1D_1/conv1d" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/conv1D_1/conv1d/Transpose/Cast_120259_const" type="Const" version="opset1">
			<data element_type="i64" offset="4136" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/conv1D_1/conv1d/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/conv1D_1/conv1d/Squeeze/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/conv1D_1/conv1d/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/conv1D_1/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="29000" shape="1,1,64" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/conv1D_1/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/activation_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/add/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="StatefulPartitionedCall/functional_1/tcn/residual_block_0/activation_2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_0/conv1d/SpaceToBatchND/aligned_block_shape/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i32" offset="29128" shape="3" size="12"/>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_0/conv1d/SpaceToBatchND/aligned_pads_begin/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i32" offset="29140" shape="3" size="12"/>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_0/conv1d/SpaceToBatchND/aligned_pads_end/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i32" offset="29152" shape="3" size="12"/>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_0/conv1d/SpaceToBatchND" type="SpaceToBatch" version="opset2">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>3</dim>
				</port>
				<port id="3">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16">
					<dim>2</dim>
					<dim>4</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_0/conv1d/ExpandDims/dim/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_0/conv1d/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>4</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_0/conv1d/ExpandDims/Transpose/Cast_120327_const" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_0/conv1d/ExpandDims/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_0/conv1d/ExpandDims_1/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="29164" shape="64,64,1,2" size="16384"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_0/conv1d" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_0/conv1d/Transpose/Cast_120323_const" type="Const" version="opset1">
			<data element_type="i64" offset="4136" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_0/conv1d/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_0/conv1d/Squeeze/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_0/conv1d/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_0/conv1d/BatchToSpaceND/aligned_block_shape/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i32" offset="29128" shape="3" size="12"/>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_0/conv1d/BatchToSpaceND/aligned_crops_begin/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i32" offset="45548" shape="3" size="12"/>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_0/conv1d/BatchToSpaceND/aligned_crops_end/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i32" offset="29140" shape="3" size="12"/>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_0/conv1d/BatchToSpaceND" type="BatchToSpace" version="opset2">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>3</dim>
				</port>
				<port id="3">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_0/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="45560" shape="1,1,64" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_0/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/activation_3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_1/conv1d/SpaceToBatchND/aligned_block_shape/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i32" offset="29128" shape="3" size="12"/>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_1/conv1d/SpaceToBatchND/aligned_pads_begin/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i32" offset="29140" shape="3" size="12"/>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_1/conv1d/SpaceToBatchND/aligned_pads_end/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i32" offset="29152" shape="3" size="12"/>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_1/conv1d/SpaceToBatchND" type="SpaceToBatch" version="opset2">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>3</dim>
				</port>
				<port id="3">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16">
					<dim>2</dim>
					<dim>4</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_1/conv1d/ExpandDims/dim/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_1/conv1d/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>4</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_1/conv1d/ExpandDims/Transpose/Cast_120295_const" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_1/conv1d/ExpandDims/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_1/conv1d/ExpandDims_1/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="45688" shape="64,64,1,2" size="16384"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_1/conv1d" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_1/conv1d/Transpose/Cast_120307_const" type="Const" version="opset1">
			<data element_type="i64" offset="4136" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_1/conv1d/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_1/conv1d/Squeeze/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_1/conv1d/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_1/conv1d/BatchToSpaceND/aligned_block_shape/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i32" offset="29128" shape="3" size="12"/>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_1/conv1d/BatchToSpaceND/aligned_crops_begin/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i32" offset="45548" shape="3" size="12"/>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_1/conv1d/BatchToSpaceND/aligned_crops_end/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i32" offset="29140" shape="3" size="12"/>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_1/conv1d/BatchToSpaceND" type="BatchToSpace" version="opset2">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>3</dim>
				</port>
				<port id="3">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_1/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="62072" shape="1,1,64" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/conv1D_1/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/activation_4/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/add_1/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="StatefulPartitionedCall/functional_1/tcn/residual_block_1/activation_5/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_0/conv1d/SpaceToBatchND/aligned_block_shape/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i32" offset="62200" shape="3" size="12"/>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_0/conv1d/SpaceToBatchND/aligned_pads_begin/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i32" offset="29152" shape="3" size="12"/>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_0/conv1d/SpaceToBatchND/aligned_pads_end/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i32" offset="62212" shape="3" size="12"/>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_0/conv1d/SpaceToBatchND" type="SpaceToBatch" version="opset2">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>3</dim>
				</port>
				<port id="3">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16">
					<dim>4</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_0/conv1d/ExpandDims/dim/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_0/conv1d/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_0/conv1d/ExpandDims/Transpose/Cast_120243_const" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_0/conv1d/ExpandDims/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_0/conv1d/ExpandDims_1/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="62224" shape="64,64,1,2" size="16384"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_0/conv1d" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_0/conv1d/Transpose/Cast_120325_const" type="Const" version="opset1">
			<data element_type="i64" offset="4136" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_0/conv1d/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_0/conv1d/Squeeze/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_0/conv1d/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_0/conv1d/BatchToSpaceND/aligned_block_shape/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i32" offset="62200" shape="3" size="12"/>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_0/conv1d/BatchToSpaceND/aligned_crops_begin/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i32" offset="45548" shape="3" size="12"/>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_0/conv1d/BatchToSpaceND/aligned_crops_end/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i32" offset="78608" shape="3" size="12"/>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_0/conv1d/BatchToSpaceND" type="BatchToSpace" version="opset2">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>3</dim>
				</port>
				<port id="3">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_0/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="78620" shape="1,1,64" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_0/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/activation_6/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_1/conv1d/SpaceToBatchND/aligned_block_shape/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i32" offset="62200" shape="3" size="12"/>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_1/conv1d/SpaceToBatchND/aligned_pads_begin/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i32" offset="29152" shape="3" size="12"/>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_1/conv1d/SpaceToBatchND/aligned_pads_end/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i32" offset="62212" shape="3" size="12"/>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_1/conv1d/SpaceToBatchND" type="SpaceToBatch" version="opset2">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>3</dim>
				</port>
				<port id="3">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16">
					<dim>4</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_1/conv1d/ExpandDims/dim/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_1/conv1d/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_1/conv1d/ExpandDims/Transpose/Cast_120257_const" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_1/conv1d/ExpandDims/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_1/conv1d/ExpandDims_1/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="78748" shape="64,64,1,2" size="16384"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_1/conv1d" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_1/conv1d/Transpose/Cast_120291_const" type="Const" version="opset1">
			<data element_type="i64" offset="4136" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_1/conv1d/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_1/conv1d/Squeeze/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_1/conv1d/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_1/conv1d/BatchToSpaceND/aligned_block_shape/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i32" offset="62200" shape="3" size="12"/>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="StatefulPartitionedCall/functional_1/tcn/residual_block_2/conv1D_1/conv1d/BatchToSpaceND/aligned_crops_begin/Output_0/Data__const" type="Const" version="opset1">
